[Wotc_apa_FieldSupport X2SoldierClassTemplate]
DisplayName="战场支援军官"
ClassSummary="战场支援军官是战场支援领域的专家。他们增强盟友的力量，并引导火力攻击更脆弱的敌人。他们配备突击步枪或维克多步枪，并搭配全息目标指示器。"

AbilityTreeTitles[0]="警戒"
AbilityTreeTitles[1]="支援"
AbilityTreeTitles[2]="观察手"
AbilityTreeTitles[3]="XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"

RandomNickNames[0]=圣骑士
RandomNickNames[1]=庇护
RandomNickNames[2]=守卫者
RandomNickNames[3]=守护者
RandomNickNames[4]=十字军
RandomNickNames[5]=骑士
RandomNickNames[6]=慈悲
RandomNickNames_Female[1]=亚马逊
RandomNickNames_Female[2]=雅典娜


; - GTS Unlocks -

[WOTC_APA_PFUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "战场支援军官：战术灵活性提升 I"
Summary = "所有战场支援军官的战术灵活性熟练度现在将根据等级从2级开始。"

[WOTC_APA_PFUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "战场支援军官：战术灵活性提升 II"
Summary = "所有战场支援军官的战术灵活性熟练度现在将根据等级从3级开始。<br/><br/><font color='#CA7200'>需要专注注意 I</font>"


[WOTC_APA_TacticalFlexibility X2AbilityTemplate]
LocFriendlyName = "战术灵活性"
LocHelpText = "战场支援军官的战术灵活性随着经验提升。"
LocLongDescription = "战场支援军官的战术灵活性随着经验提升。"
LocPromotionPopupText = "<font color='#CA7200'>等级 I</font> （在 <Ability:RANKNAME1/> 军衔 [1]获得）<br/><Bullet/> 获得补给跑 - 对盟友使用补给弹药或绷带投掷可获得一个仅限移动的行动点。<br/><br/><font color='#CA7200'>等级 II</font> （在 <Ability:RANKNAME3/> 军衔 [3]获得）<br/><Bullet/>获得肾上腺素激增 - 激活以获得额外的一个非移动行动点，即使是在冲刺后也可以使用，但本回合剩余时间内会受到-25%的伤害惩罚。（类似于带伤害惩罚的跑动射击）。<br/><Bullet/> 获得低姿态 - 士兵将低掩体视为高掩体。<br/><br/><font color='#CA7200'>等级 III</font> （在 <Ability:RANKNAME6/> 军衔 [6]获得）<br/><Bullet/> 获得幻影 - 授予暗影步和重新定位能力。<br/><Bullet/> 获得冲刺 - 激活以获得额外的一个仅限移动的行动点。免费行动，4回合冷却。<br/>"



;[HoloTargeting X2AbilityTemplate]
;LocFriendlyName="全息瞄准弹药"
;LocLongDescription="任何对准目标的精确 <Ability:WeaponName/> 射击，无论是命中还是未命中，都将标记目标，增加你的小队对目标的命中 +<Ability:HOLOTARGETAIMBONUS/> 。"
;LocHelpText="射击目标将增加小队对目标的命中。"
;LocFlyOverText="全息瞄准弹药"
;LocPromotionPopupText="<Bullet/> 像压制这样的定向 <Ability:WeaponName/> 能力将获得全息标记。<br/><Bullet/> 任何针对多个单位的技能将不会获得全息标记。<br/>"

[Mrc_APA_FreeBeacon X2AbilityTemplate]
LocFriendlyName="诱饵"
LocLongDescription="提供免费模拟信标。"
LocHelpText="提供免费模拟信标。"
LocPromotionPopupText="提供免费模拟信标。"

;[Mrc_APA_HOLOFO X2AbilityTemplate]
;LocFriendlyName="大规模全息标记"
;LocLongDescription="全息标记可视范围内的所有敌人，增加你的小队对目标的命中 +<Ability:HOLOTARGETAIMBONUS/> 。不会从其他全息标记者技能中获得加成。"
;LocHelpText="全息标记可视范围内的所有敌人，增加你的小队对目标的命中 +<Ability:HOLOTARGETAIMBONUS/> 。不会从其他全息标记者技能中获得加成。"
;LocFlyOverText="全息脸对脸"
;LocPromotionPopupText="全息标记可视范围内的所有敌人。"

[IRI_PullAlly X2AbilityTemplate]
LocFriendlyName="重新定位盟友"
LocLongDescription="使用抓钩枪将盟友单位拉向你的位置，优先选择掩体位置。 <Ability:PullAllyCooldown/> 回合冷却。"
LocHelpText="使用抓钩枪将盟友单位拉向你的位置。"
LocPromotionPopupText=""
LocFlyOverText="重新定位盟友"
